app/Controllers/ProductoController.php

    public function index()
    {
        $productos = $this->productoModel->orderBy('nombre', 'desc')->findAll();
---
SELECT *
FROM `productos`
ORDER BY `nombre` DESC